{
    "German baked apples": {
        "body": "German baked apples (German: Bratapfel) are a German dish of baked apples traditionally made with the Dutch Belle de Boskoop apple. They can be prepared with many different fillings and are a common Christmas dish. Often they are served with vanilla custard.\n\nBackground\nApples are the most widely grown fruit in Germany, used to prepare many dishes and beverages in German cuisine. Apples were the only locally grown fruit in Germany that kept during the winter months, which made baked apples an economical choice for holiday desserts in the Christmas traditions of Germany or as a sweet main dish in cold weather.\n\nPreparation\nThe whole apples once cored can be stuffed with assorted fillings made from chopped almonds, marzipan, raisins, rum, butter, lemon juice, sugar, spices and other ingredients. Some versions are baked in a baking dish with white wine and honey and baked until tender. They are usually served with vanilla custard or ice cream.Apples can be baked on top of a wood stove or in the oven in round enamel cast iron dishes called \"apple schnitzers\". The dish has a spike in the center that cooks the cored apple from the inside out. Schnitzers may be a German invention, no longer widely used in Germany, but still found among Amish communities in the United States.\n\nSee also\nLebkuchen\nList of apple dishes\nSpringerle\nStollen\n\n\n== References ==",
        "pages": [
            "Custard",
            "Lebkuchen",
            "Marzipan",
            "Springerle",
            "Stollen"
        ],
        "categories": [
            "Category:Baked foods"
        ]
    },
    "Ham loaf": {
        "body": "Ham loaf or hamloaf is a baked meat dish, similar to meatloaf, made of ground ham and ground pork and combined with other ingredients to form a loaf like shape. Distinct in color and taste from meatloaf, hamloaf is often baked with a sweet glaze, often consisting of brown sugar, molasses, pineapples, or cherries. In Pennsylvania, hamloaf is sometimes served with a sauce consisting of vinegar, mustard, and brown sugar.  Eggs, milk, often evaporated, and some type of filling ingredient, bread or cracker crumbs, are used to create the loaf form.Attributed as a traditional Pennsylvania Dutch cuisine, hamloaf is eaten throughout Pennsylvania, Ohio, Kentucky, Indiana, and many other midwest states and is often served on special occasions, including Easter.\n\n\n== References ==",
        "pages": [
            "Ham",
            "Meatloaf"
        ],
        "categories": [
            "Category:Baked foods"
        ]
    },
    "Prague Ham": {
        "body": "Prague Ham (Czech: Pražská šunka, German: Prager Schinken) is a type of brine-cured, stewed, and mildly beechwood-smoked boneless ham originally from Prague in Bohemia (Czech Republic). When cooked on the bone, it is called šunka od kosti (\"ham from the bone\"), considered a delicacy. It was first marketed in the 1860s by Antonín Chmel, a pork butcher from Prague's Zvonařka (\"Bell-Maker street\") on the Nuselské schody (The Nusle Steps).It was a popular export during the 1920s and 1930s – to the point that other cultures started copying the recipe and making it domestically. Pražská šunka/Prague Ham is registered as a Traditional Speciality Guaranteed in the European Union and the UK and can only be produced according to a specified procedure.\n\nPrague Ham as street food\nPrague Ham is traditionally served in restaurants and from street vendors with a side of boiled potatoes and often accompanied by Czech beer.Most street vendors sell it by weight in grams rather than per serving.\n\nNames in other languages\nThe following translations are registered for the Traditional Speciality Guaranteed:\nBulgarian: Пражка шунка.\nCzech and Slovakian: Pražská šunka.\nDanish: Prag Skinke.\nDutch: Praagse Ham.\nEstonian: Praha sink.\nFinnish: Prahalainen kinkku.\nGerman: Prager Schinken.\nGreek: Χοιρομέρι Πράγας.\nHungarian: Prágai minőségi sonka.\nItalian: Prosciutto di Praga.\nLatvian: Prāgas šķiņķis.\nMaltese: Perżut ta' Praga.\nNorwegian: Pragerskinke.\nPolish: Szynka Praska.\nPortuguese: Fiambre de Praga.\nRomanian: Suncă de Praga.\nSerbo-Croatian and Slovene: Praška šunka.\nSerbian: Прашка шунка\nSpanish: Jamón de Praga.\nSwedish: Pragskinka.\n\nSee also\nCzech cuisine\nList of hams\n\n\n== References ==",
        "pages": [
            "Ham loaf",
            "Prosciutto"
        ],
        "categories": [
            "Category:Smoked meat"
        ]
    }
}
